openfoam/day1/chamber-centred-fine/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

// Educational chamber; these are not Oxford Instruments equipment dimensions.
// Coordinates are in metres. X = horizontal, Y = vertical, Z = depth.
// 200 x 100 x 1 cells: 0.5 mm in X/Y; unchanged 1 mm depth.
// Ten connected blocks let us label separate openings and the wafer segment.
// Shared block faces are internal fluid connections, NOT walls.
scale 1;

vertices
(
    (0 0 0) // vertex 0
    (0.02 0 0) // vertex 1
    (0.045 0 0) // vertex 2
    (0.055 0 0) // vertex 3
    (0.08 0 0) // vertex 4
    (0.1 0 0) // vertex 5
    (0 0.01 0) // vertex 6
    (0.02 0.01 0) // vertex 7
    (0.045 0.01 0) // vertex 8
    (0.055 0.01 0) // vertex 9
    (0.08 0.01 0) // vertex 10
    (0.1 0.01 0) // vertex 11
    (0 0.05 0) // vertex 12
    (0.02 0.05 0) // vertex 13
    (0.045 0.05 0) // vertex 14
    (0.055 0.05 0) // vertex 15
    (0.08 0.05 0) // vertex 16
    (0.1 0.05 0) // vertex 17
    (0 0 0.001) // vertex 18
    (0.02 0 0.001) // vertex 19
    (0.045 0 0.001) // vertex 20
    (0.055 0 0.001) // vertex 21
    (0.08 0 0.001) // vertex 22
    (0.1 0 0.001) // vertex 23
    (0 0.01 0.001) // vertex 24
    (0.02 0.01 0.001) // vertex 25
    (0.045 0.01 0.001) // vertex 26
    (0.055 0.01 0.001) // vertex 27
    (0.08 0.01 0.001) // vertex 28
    (0.1 0.01 0.001) // vertex 29
    (0 0.05 0.001) // vertex 30
    (0.02 0.05 0.001) // vertex 31
    (0.045 0.05 0.001) // vertex 32
    (0.055 0.05 0.001) // vertex 33
    (0.08 0.05 0.001) // vertex 34
    (0.1 0.05 0.001) // vertex 35
);

blocks
(
    hex (0 1 7 6 18 19 25 24) (40 20 1) simpleGrading (1 1 1)
    hex (1 2 8 7 19 20 26 25) (50 20 1) simpleGrading (1 1 1)
    hex (2 3 9 8 20 21 27 26) (20 20 1) simpleGrading (1 1 1)
    hex (3 4 10 9 21 22 28 27) (50 20 1) simpleGrading (1 1 1)
    hex (4 5 11 10 22 23 29 28) (40 20 1) simpleGrading (1 1 1)
    hex (6 7 13 12 24 25 31 30) (40 80 1) simpleGrading (1 1 1)
    hex (7 8 14 13 25 26 32 31) (50 80 1) simpleGrading (1 1 1)
    hex (8 9 15 14 26 27 33 32) (20 80 1) simpleGrading (1 1 1)
    hex (9 10 16 15 27 28 34 33) (50 80 1) simpleGrading (1 1 1)
    hex (10 11 17 16 28 29 35 34) (40 80 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    // Top opening: x = 0.045 to 0.055 m, y = 0.05 m.
    inlet
    {
        type patch;
        faces
        (
            (14 32 33 15)
        );
    }

    // Left opening: x = 0, y = 0 to 0.01 m.
    outletLeft
    {
        type patch;
        faces
        (
            (0 18 24 6)
        );
    }

    // Right opening: x = 0.10 m, y = 0 to 0.01 m.
    outletRight
    {
        type patch;
        faces
        (
            (5 11 29 23)
        );
    }

    // Bottom wafer segment: x = 0.02 to 0.08 m, y = 0.
    wafer
    {
        type wall;
        faces
        (
            (1 2 20 19)
            (2 3 21 20)
            (3 4 22 21)
        );
    }

    // All remaining top, bottom and side surfaces.
    walls
    {
        type wall;
        faces
        (
            (0 1 19 18)
            (4 5 23 22)
            (6 24 30 12)
            (12 30 31 13)
            (13 31 32 14)
            (15 33 34 16)
            (11 17 35 29)
            (16 34 35 17)
        );
    }

    // One cell through depth; empty makes this a 2D calculation.
    frontAndBack
    {
        type empty;
        faces
        (
            (0 6 7 1)
            (18 19 25 24)
            (1 7 8 2)
            (19 20 26 25)
            (2 8 9 3)
            (20 21 27 26)
            (3 9 10 4)
            (21 22 28 27)
            (4 10 11 5)
            (22 23 29 28)
            (6 12 13 7)
            (24 25 31 30)
            (7 13 14 8)
            (25 26 32 31)
            (8 14 15 9)
            (26 27 33 32)
            (9 15 16 10)
            (27 28 34 33)
            (10 16 17 11)
            (28 29 35 34)
        );
    }

);

mergePatchPairs ();
